src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://code.academy.pl/countries/">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>France</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>